this class is used for dimension ordinate setting
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public class OrdinateDimensionSetting : IDisposable
  Visual Basic
Public Class OrdinateDimensionSetting _
	Implements IDisposable
  Visual C++
public ref class OrdinateDimensionSetting : IDisposable
 Remarks
 Dimension ordinate settting class
 Inheritance Hierarchy
  System Object
  Autodesk.Revit.DB OrdinateDimensionSetting
 See Also
  OrdinateDimensionSetting Members
  Autodesk.Revit.DB Namespace